var router = require('koa-router')();


router.get('/', function *(next) {
	
	num = Math.random()
	console.log(num);
	
	
	
	if (num > 0.5)
	{  yield this.render('sourcemap', {
    title: '第3段 话说东京汴梁城开封府，有个万万贯的财主员外，姓张，排行第一，双名俊卿。这个员外，冬眠红锦帐，夏卧碧纱厨，两行珠翠引，一对美人扶。家中有赤金白银、斑点玳瑁、鹘轮珍珠、犀牛头上角、大象口中牙。门首一壁开个金银铺，一壁开所质库。他那爹爹大张员外，方死不多时，只有妈妈在堂。张员外好善，人叫他做张佛子。忽一日在门首观看，见一个和尚，打扮非常。但见：双眉垂雪，横眼碧波。衣披烈火七幅鲛绡，杖拄降魔九环锡杖。若非圆寂光中客，定是楞严峰顶人。'
  });}
  else
  {
	  yield this.render('sourcemap', {
    title: '第4段 那和尚走至面前，道：“员外拜揖。”员外还礼毕，只见和尚袖中取出个疏头来，上面写道：“竹林寺特来抄化五百香罗木。”员外口中不说，心下思量：“我从小只见说竹林寺，那曾见有，况兼这香罗木，是我爹在日许下愿心，要往东峰岱岳盖嘉宁大殿，尚未答还。”员外便对和尚道：“此是我先人在日许下愿心，不敢动着。若是吾师要别物，但请法旨。”和尚道：“若员外不肯舍施，贫僧到晚自教人龋”说罢转身。员外道：“这和尚莫是风。”'
  });
  }

});


  module.exports = router;



